---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.WireMaterialTypes
source: html/dd5bc515-19eb-79b3-a5e3-2c7586b11599.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.WireMaterialTypes Property

Get electrical wire material types information of the project.

## Syntax (C#)
```csharp
public WireMaterialTypeSet WireMaterialTypes { get; }
```